Chapters/Chapter_5/free_decay_tests/HEAVE_OC6/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//User-defined parameters
#include "../myVars" //Include global variables

// Start wavesProperties.input
seaLevel	0;
//seaLevelAsReference true;

// A list of the relaxation zones in the simulation. The parameters are given
// in <name>Coeffs below.
relaxationNames (inlet outlet);

initializationName inlet; // Which theory to use for initialisation

inletCoeffs
{
    // Wave type to be used at boundary "inlet" and in relaxation zone "inlet"
    //waveType    stokesSecond; 
    waveType	potentialCurrent; 
    U           (0 0 0);
    Tsoft       0.1;

    // Ramp time of 2 s, default value: period
    // Must be 0 if we want to use setWaveField to initialise surface elevation
    //Tsoft       0;

    // Water depth at the boundary and in the relaxation zone
    //depth       $water_depth;

    // Wave period
    //period      $wave_period;

    // Phase shift in the wave
    //phi         0.000000;

    // Wave number vector, k. 
    //direction  (1.0 0.0 0.0);

    // Wave height
    //height      $wave_height;
    
    //debug       false;

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;    

        relaxType   INLET;
        startX      ($xmin 0 $zmin);
        endX        (#calc "$xmin+$in_len" 0 #calc"4.0*$wave_height");
        orientation      (1.0 0.0 0.0);
    }
};

outletCoeffs
{
    waveType    potentialCurrent; // Current which is uniform over the depth
    U           (0 0 0);
    Tsoft       0.1;

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;    

        relaxType   OUTLET;
        startX      (#calc "$xmax-$out_len" 0 $zmin);
        endX        ($xmax 0 #calc"4.0*$wave_height");
        orientation      (1.0 0.0 0.0);
    }
};

// ************************************************************************* //
