Chapters/Chapter_5/free_decay_tests/HEAVE_OC6/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      3; //1;
        nAlphaSubCycles 2; //1;
        alphaOuterCorrectors yes;
        cAlpha          0.5;

        MULESCorr       yes;
        nLimiterIter    3;//3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    pcorr GAMG
    {
        tolerance        1e-4;
        relTol           0.0;

        smoother         DIC;//GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 1000;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    pcorrFinal GAMG
    {
        tolerance        1e-6;
        relTol           0.0;

        smoother         DIC;//GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 1000;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    p_rgh GAMG
    {
        tolerance        1e-4;
        relTol           0.0;

        smoother         DIC;//GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 1000;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    p_rghFinal GAMG
    {
        tolerance        1e-6;
        relTol           0.0;

        smoother         DIC;//GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 1000;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    "(U|k|omega|nut|nuTilda)" PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };

    "(U|k|omega|nut|nuTilda)Final" PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };

   //ONLY FOR moveDynamicMesh
    cellDisplacement
    {   
        solver          GAMG;
        tolerance       1e-8;
        relTol          0;  
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10; 
        agglomerator    faceAreaPair;
        mergeLevels     1;  
    }
       
    cellDisplacementFinal
    {   
        $cellDisplacement;
        tolerance       1e-8;
        relTol          0;  
    }

}


PIMPLE 
{ 
    momentumPredictor yes;
    nOuterCorrectors 3;
    nCorrectors     3;
    nNonOrthogonalCorrectors 2;
    moveMeshOuterCorrectors true; // Default = false;
    correctPhi true; //Flux correction functions to ensure continuity. Specially for moving meshes or VOF.
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*" 1;
    }
}


// ************************************************************************* //
